export const noseCreator = (type, noseFractureSide, sinusitisType) => {
  const noseBreathing =
    type === "adenoids" || type === "septumCurvature" ? `утруднене` : `вільне`;
  const defaultTempate = ` деформацій зовнішнього носу та проекцій придаткових пазух не виявлено. Пальпаторно передні стінки верхньощелепних та лобних пазух безболісні, набряку чи асиметрії не виявлено.
   Носове дихання ${noseBreathing} з обох боків.  Нюх  збережений  в  повному об’ємі. `;
  const noseFractureTemplate = `Помірна деформацiя зовнiшнього носа зі зміщенням піраміди ${noseFractureSide} у вигляді дуги.
   Пальпаторно передні стінки верхньощелепних та лобних пазух з обох сторін безболісні.
    Носове дихання утруднене з обох сторін.  `;
  const sinusitisTemplate = ` деформацій зовнішнього носу та проекцій придаткових пазух не виявлено. Пальпаторно передні стінки верхньощелепних та лобних пазух безболіснi, набряку чи асиметрії не виявлено.
 Носове дихання утруднене з обох  боків,  нюх  збережений,  знижений. `;
  switch (type) {
    case "noseFracture":
      return noseFractureTemplate;
    case "sinusitis":
      return sinusitisTemplate;
    default:
      return defaultTempate;
  }
};

export const rhinoscopyCreator = (
  type,
  noseFractureSide,
  septumCurvatureSide,
  sinusitisType,
  sinusitisSide,
  sinusitisVariety
) => {
  const addition =
    type === "adenoids"
      ? `Визначаються аденоїдні вегетації III-го ступеню.`
      : ``;
  const septumSide = septumCurvatureSide ? `праворуч` : "ліворуч";
  const defaultTempate = `присінок носу вільний, носова перегородка рівна, слизова оболонка блідо-рожева, носові ходи вільні, носові  раковини   незбiльшенi,  виділення відсутні. ${addition}`;
  const noseFractureTemplate = ` Присінок  носа вільний,  носова переділка зміщена ${noseFractureSide}, слизова оболонка обох половин носа дещо гiперемована,
   незначно потовщена. Раковини  дещо збiльшенi,  не значні слизово-кров’янисті виділення. `;
  const septumCurvatureTemplate = `присінок носу вільний, носова перегородка різко скривлена ${septumSide}, слизова оболонка блідо-рожева, носові ходи вільні, носові  раковини   не збільшені,  виділення відсутні.`;
  const sinusitisTemplate = `присінок носу вільний, носова перегородка рівна, 
  слизова оболонка гіперемована, набрякла, в ${
    sinusitisType === `maxillaSinusitis`
      ? "середньому носовому ході"
      : " середньому та верхньому носовому ході"
  } ${sinusitisSide !== `двобічний` ? sinusitisSide : "з обох сторін"} ${
    sinusitisVariety === `бактерійний`
      ? "слизово-гнійні виділення жовто-зеленого забарвлення"
      : "рясні прозорі слизові виділення"
  }, носові  раковини   незбiльшенi. Носоглотка вільна. `;
  switch (type) {
    case "noseFracture":
      return noseFractureTemplate;
    case "septumCurvature":
      return septumCurvatureTemplate;
    case "sinusitis":
      return sinusitisTemplate;
    default:
      return defaultTempate;
  }
};

export const oropharyngoscopyCreator = (type, paratonsilarAbscessSide) => {
  const tonsilitisTemplate = `піднебінні дужки контуруються, гіперемійовані з потовщеним переднім краєм,  піднебінні мигдалики виступають за передні піднебінні дужки, доводячи до серединної лінії зіву, лакуни  рихлі, виповнені патологічним вмістом білуватого кольору, при натискуванні шпателем легко видаляються, мають неприємний запах. Задня стінка глотки волога, з небагаточисельними лімфоїдними фолікулами.`;
  const defaultTempate = `відкривання рота в повному обсязі,  слизова оболонка порожнини рота блідо-рожева, помірно зволожена. Вивідні протоки великих слинних залоз без патологічних змін.  Піднебінні дужки  контуруються,  рожевого  кольору,  піднебінні мигдалики не виступають за передні піднебінні дужки,  лакуни без патологічного вмісту, поверхня гладка. Задня стінка глотки волога. Глотковий рефлекс збережений.  Носоглотка:  склепіння вільне, слизова оболонка рожева, волога,  хоани вільні,  задні кінці верхніх,  середніх та  нижніх носових  раковин  не  збільшені.  Вічка слухових труб добре диференційовані, вільні. Гортаноглотка: Язиковий мигдалик не збільшений,  валекули вільні,  задня та бокові стінки глотки рожеві, вологі,  грушовидні синуси при фонації добре розкриваються, вільні, їх слизова оболонка рожева,  волога.  `;
  const paratonsilarAbscessTemplate = `
  наявне обмежене відкривання рота ІІ-го ступеню 
  за рахунок тризму жувальної мускулатури. 
  Піднебінні дужки  контуруються,  рожевого  кольору, виражена асиметрія зіву ${paratonsilarAbscessSide} за
   рахунок випинання передньої піднебінної, 
   піднебінний мигдалик тут виступає за передню піднебінну дужку,  
   лакуни з патологічним вмістом – гнійний детрит, поверхня гладка. 
   Задня стінка глотки волога, 
   незначно гіперемована з небагаточисельними лімфоїдними фолікулами. 
   Глотковий рефлекс збережений.  Носоглотка:  склепіння вільне, слизова оболонка рожева, 
   волога,  хоани вільні,  задні кінці верхніх,  
   середніх та  нижніх носових  раковин  не  збільшені.  
   Вічка слухових труб добре диференційовані, вільні. Гортаноглотка: Язиковий мигдалик не збільшений,  валекули вільні,  задня та бокові стінки глотки рожеві, вологі,  грушовидні синуси при фонації добре розкриваються, вільні, їх слизова оболонка рожева,  волога.  `;
  switch (type) {
    case "tonsilitis":
      return tonsilitisTemplate;
    case "paratonsilarAbscess":
      return paratonsilarAbscessTemplate;
    default:
      return defaultTempate;
  }
};

export const laryngoscopyCreator = (type) => {
  const defaultTempate = `гортань правильної форми, пасивно рухома, симптом хрусту добре виражений. При ларингоскопії  слизова  оболонка  надгортанника,  ділянки черпакуватих хрящів, мiжчерпакуватого простору та вестибулярних складок рожевого кольору, волога з гладкою поверхнею, голосові складки перламутрово-сiрi,  надгортанник розвернутий у вигляді  пелюстка,  голосові  складки  рухомі при фонації, пiдскладковий  простір вільний; голос звучний, дихання вільне.`;
  return defaultTempate;
};
export const otoscopyCreator = (
  type,
  acuteOtitisSide,
  mastoiditisSide,
  acuteOtitisType
) => {
  const bothSides = "з обох боків";
  const firstDefaultPart = `соскоподібні паростки не змінені. Шкіра в їх проекції блідо-рожева. Вушні раковини звичайні.
  Зовнішні слухові ходи вільні.`;
  const defaultTempate = ` ${firstDefaultPart} Барабанні перетинки перламутрово-сірі, пізнавальні точки  визначаються. Перфорації відсутні. Виділення відсутні.
  `;
  const drumPart =
    acuteOtitisSide === "двобічний"
      ? `Барабанні перетинки справа та зліва набряклі, мутно-жовтого забарвлення.`
      : `Барабанна перетинка ${
          acuteOtitisSide !== "двобічний" ? acuteOtitisSide : bothSides
        } набрякла, мутно-жовтого забарвлення.`;
  const recognizePart = `Пізнавальні точки не визначаються ${
    acuteOtitisSide !== "двобічний" ? acuteOtitisSide : bothSides
  }.`;
  const cataralDrumPart = `Барабанна перетинка гіперемійована та потовщена ${
    acuteOtitisSide !== "двобічний" ? acuteOtitisSide : bothSides
  }. `;
  const purulentTemplate = `${firstDefaultPart} ${drumPart} ${recognizePart}`;
  const cataralTemplate = `${firstDefaultPart} ${cataralDrumPart} ${recognizePart}`;
  const acuteOtitisTemplate =
    acuteOtitisType === "гнійний" ? purulentTemplate : cataralTemplate;
  const healthySide = mastoiditisSide === `ліворуч` ? "праворуч" : "ліворуч";
  const mastoiditisMiddlePart =
    mastoiditisSide === `двобічний`
      ? ` Зовнішній слуховий не є вільним ${bothSides}. Барабанні перетинки не є сірими ${bothSides}.
Пізнавальні точки не визначаються. 
Перфорації відсутні. Виділення відсутні. Барабанні перетинки ${bothSides} потовщені,
 гіперемійовані по колу.`
      : `Cоскоподібні паростки: ${healthySide} в нормі, ${mastoiditisSide} 
      спостерігається гіперемія шкіри та набряк привушної ділянки в ділянці соскоподібного відростка. 
      Зовнішній слуховий хід ${healthySide} вільний. Барабанна перетинка ${healthySide} сіра. 
      Пізнавальні точки визначаються на барабанній перетинці лише ${healthySide}. 
      Перфорації відсутні. Виділення відсутні. Зовнішній слуховий прохід вільний ${mastoiditisSide}, барабанна перетинка потовщена, 
      гіперемійована по колу, пізнавальні точки не визначаються. Перфорація відсутня.
      `;
  const mastoiditisTemplate = `спостерігається гіперемія шкіри 
  та набряк привушної ділянки в ділянці соскоподібного відростка ${
    mastoiditisSide !== "двобічний" ? mastoiditisSide : bothSides
  }. 
  ${mastoiditisMiddlePart}
  `;
  switch (type) {
    case "acuteOtitis":
      return acuteOtitisTemplate;
    case "mastoiditis":
      return mastoiditisTemplate;
    default:
      return defaultTempate;
  }
};
