export const initialParams = {
  mutualExamination: "Спільний огляд зі зав.відділенням ЗАВІДУЮЧИЙ ВІДДІЛЕННЯ",
  doctorType: "Отоларинголог",
  medicalCard: "Медична карта стаціонарного хворого",
  patientType: "Дитина",
  preOperationExamination: ` заступника головного лікаря по хірургічній роботі ЗАСТУПНИК, зав. отоларингологічного відділення ЗАВІДУЮЧИЙ ВІДДІЛЕННЯ`,
  treatmentLocation: `Дитина знаходилася на лікуванні в НАЗВА ВІДДІЛЕННЯ НАЗВА ЗАКЛАДУ`,
  institution: `НАЗВА ЗАКЛАДУ, вулиця НАЗВА ВУЛИЦІ, НАЗВА МІСТА, НАЗВА ОБЛАСТІ, ПОШТОВИЙ ІНДЕКС`,
  edrpouCode: `ЗНАЧЕННЯ КОДУ ЄДРПОУ`,
  doctors: `Особистий лікар,ЛІКАР_1,ЛІКАР_2,ЛІКАР_3`,
  anesthetistList: `Анестезіолог,відсутній,АНЕЗТЕЗІОЛОГ_1,АНЕСТЕЗІОЛОГ_2,АНЕСТЕЗІОЛОГ_3`
};
